{
  "markdown": "# How to Win Friends and Influence People\n\n*Timeless human skills for trust, goodwill, and real influence.*\n\n---\n\n## *Don’t criticize, condemn, or complain*\n\n> \"Any fool can criticize, condemn and complain—and most fools do.\"\n\n- Criticism makes people defensive and less open to change.\n- Understanding preserves dignity and keeps dialogue alive.\n- Start by asking: what pressure or story might explain this behavior?\n\n> Reflection: Where can I replace a complaint with a curious question today?\n\n---\n\n## *Give honest and sincere appreciation*\n\n> \"Be hearty in your approbation and lavish in your praise.\"\n\n- People crave to feel seen—specific praise builds trust and energy.\n- Appreciation is not flattery; name the behavior and its impact.\n- Recognize effort, not just outcomes, to encourage persistence.\n\n> Prompt: Who deserves precise, genuine thanks from me before the day ends?\n\n---\n\n## *Arouse an eager want*\n\n> \"Arouse in the other person an eager want.\"\n\n- Influence grows when goals are framed in *their* interests.\n- Translate your idea into benefits that matter to them.\n- Ask, \"If this worked perfectly for you, what would it do?\"\n\n> Reflection: How can I restate my request so it clearly serves their priorities?\n\n---\n\n## *Become genuinely interested in other people*\n\n> \"You can make more friends in two months by becoming interested in other people than in two years by trying to get people interested in you.\"\n\n- Curiosity signals respect; it invites stories, not performances.\n- Prepare thoughtful questions; listen for values and motives.\n- Remember small details—they’re clues to what matters most.\n\n> Prompt: What is one sincere follow-up question I can ask someone today?\n\n---\n\n## *Remember that a name matters*\n\n> \"A person’s name is to that person the sweetest and most important sound in any language.\"\n\n- A name says: *I notice you*; it humanizes every interaction.\n- Use, spell, and pronounce it correctly; verify if unsure.\n- Tie the name to a detail to help memory stick.\n\n> Reflection: Whose name have I been overlooking—and how will I use it respectfully next time?\n\n---\n\n## *Be a good listener; encourage others to talk about themselves*\n\n> \"Be a good listener. Encourage others to talk about themselves.\"\n\n- Listening without interruption de-escalates and reveals solutions.\n- Mirror key words and summarize to show you understood.\n- Silence can be generous—let them finish the thought.\n\n> Prompt: In my next conversation, how will I prove I heard the *meaning*, not just the words?\n\n---\n\n## *Avoid arguments; show respect for opinions*\n\n> \"The only way to get the best of an argument is to avoid it.\"\n\n- Arguing hardens positions; agreement on facts requires safety first.\n- Start with points of agreement and shared aims.\n- Never say \"You’re wrong\"; try, \"I may be mistaken—here’s how I see it.\"\n\n> Reflection: Where can I trade being \"right\" for being effective today?\n\n---\n\n## *Admit mistakes quickly and emphatically*\n\n> \"If you are wrong, admit it quickly and emphatically.\"\n\n- Owning errors restores credibility faster than defense or delay.\n- A clean apology focuses on impact and repair, not excuses.\n- Turn the lesson into a next-step commitment.\n\n> Prompt: What’s one mistake I can openly own—and what repair will I offer?\n\n---\n\n## *Let others own the idea*\n\n> \"Let the other person feel that the idea is his or hers.\"\n\n- Co-creation beats compliance; people support what they help build.\n- Ask for input early; spotlight their contributions.\n- Frame the path as a shared experiment, not a decree.\n\n> Reflection: How can I invite authorship instead of delivering conclusions?\n\n---\n\n## *Takeaway: Lead with respect to earn influence*\n\n*Carnegie’s message is simple and demanding: center others—their dignity, interests, and names—and your influence will follow.*\n\nWhen we replace criticism with curiosity, praise with precision, and argument with understanding, we create the conditions where people *want* to work with us. Practice one principle per day, reflect each night, and let your relationships become your greatest asset.",
  "outputPrefix": "how_to_win_friends"
}